In [2]:
import pandas as pd

In [3]:
df = pd.read_csv('titanic.csv')

In [4]:
df.shape

(891, 12)

In [5]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [6]:
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [9]:
df1 = df.drop(['PassengerId', 'Name', 'SibSp', 'Parch', 'Ticket', 'Cabin', 'Embarked'], axis = 1)

In [10]:
df1.shape

(891, 5)

In [11]:
df1.columns

Index(['Survived', 'Pclass', 'Sex', 'Age', 'Fare'], dtype='object')

In [14]:
inputs = df1.drop('Survived', axis = 1)

In [15]:
inputs.columns

Index(['Pclass', 'Sex', 'Age', 'Fare'], dtype='object')

In [18]:
target = df1[['Survived']]

In [19]:
target.columns

Index(['Survived'], dtype='object')

In [20]:
pd.isnull(inputs).sum()

Pclass      0
Sex         0
Age       177
Fare        0
dtype: int64

In [22]:
inputs.Age = inputs.Age.fillna(inputs.Age.mean())

In [23]:
pd.isnull(inputs).sum()

Pclass    0
Sex       0
Age       0
Fare      0
dtype: int64

In [24]:
inputs.head()

   Pclass     Sex   Age     Fare
0       3    male  22.0   7.2500
1       1  female  38.0  71.2833
2       3  female  26.0   7.9250
3       1  female  35.0  53.1000
4       3    male  35.0   8.0500

In [25]:
from sklearn.preprocessing import LabelEncoder

In [26]:
le_sex = LabelEncoder()

In [27]:
inputs['sex_n'] = le_sex.fit_transform(inputs['Sex'])

In [28]:
inputs.head()

   Pclass     Sex   Age     Fare  sex_n
0       3    male  22.0   7.2500      1
1       1  female  38.0  71.2833      0
2       3  female  26.0   7.9250      0
3       1  female  35.0  53.1000      0
4       3    male  35.0   8.0500      1

In [29]:
inputs = inputs.drop('Sex', axis = 1)

In [30]:
inputs.head()

   Pclass   Age     Fare  sex_n
0       3  22.0   7.2500      1
1       1  38.0  71.2833      0
2       3  26.0   7.9250      0
3       1  35.0  53.1000      0
4       3  35.0   8.0500      1

In [31]:
from sklearn.model_selection import train_test_split

In [32]:
x_train, x_test, y_train, y_test = train_test_split(inputs, target, test_size = 0.2)

In [33]:
inputs.shape

(891, 4)

In [34]:
len(x_train)

712

In [35]:
len(x_test)

179

In [36]:
from sklearn import tree

In [37]:
model = tree.DecisionTreeClassifier()

In [38]:
model.fit(x_train, y_train)

DecisionTreeClassifier()

In [40]:
model.score(x_train, y_train)

0.9817415730337079